src/test/resources/wiremock/__files/takeProduct-1-request.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:takeProduct xmlns:ns2="urn:GizaAPI"><ticket><session>16319-00016306-00009951-00000000-3062</session><deadline xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><localTime>2023-10-06T12:00:55</localTime><shopName>ShoppingMall</shopName><actionsLimit xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ticketsLimit xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><comment>Welcome in RAC (RedBay Apps Center)</comment></ticket><id>484462356</id><code/></ns2:takeProduct></S:Body></S:Envelope>